import mem13 from "../../static/images/mems/mem13.png";
import mem18 from "../../static/images/mems/mem18.png";
import mem20 from "../../static/images/mems/mem20.png";
import mem21 from "../../static/images/mems/mem21.png";
import mem24 from "../../static/images/mems/mem24.png";

const chats = [
  {
    _id: "sgbfmytyjj8",
    firstName: "Екатерина",
    lastName: "Колесникова",
    avatar: mem18,
    messages: [
      {
        creatorId: "ef234padk",
        timestamp: "21:21",
        message: "привет!!!!",
      },
    ],
  },
  {
    _id: "asdwefwgweg5",
    firstName: "Мария",
    lastName: "Остапенко",
    avatar: mem13,
    messages: [
      {
        creatorId: "asdwefwgweg5",
        timestamp: "13:13",
        message: "Привет! Как дела?",
      },
      {
        creatorId: "ef234padk",
        timestamp: "13:14",
        message: "Привет!",
      },
      {
        creatorId: "ef234padk",
        timestamp: "13:15",
        message: "Вcё супер. Ты как?",
      },
      {
        creatorId: "asdwefwgweg5",
        timestamp: "13:26",
        message: "Отлично",
      },
      {
        creatorId: "asdwefwgweg5",
        timestamp: "13:27",
        message: "Хочешь анекдот?",
      },
      {
        creatorId: "ef234padk",
        timestamp: "13:29",
        message: "Давай",
      },
      {
        creatorId: "asdwefwgweg5",
        timestamp: "13:33",
        message: `Заходит как-то раз 🐌 в бар и подходит к бармену, заказывает стакан воды и уходит. Приходит на следующий день, снова заказывает стакан воды и так ещё несколько дней подряд. 
        В какой-то из дней, бармен спрашивает у улитки: 
          - Улитка, почему ты заказываешь воду, ведь у меня столько алкоголя?
          Улитка ему отвечает:
          - Не сейчас, у меня дом горит.`,
      },
    ],
  },
  {
    _id: "saaesgwer90",
    firstName: "Артём",
    lastName: "Карпов",
    avatar: mem21,
    messages: [
      {
        creatorId: "saaesgwer90",
        timestamp: "12:12",
        message: "АХАХАХАХахахахххаа",
      },
      {
        creatorId: "ef234padk",
        timestamp: "12:26",
        message: ":)))",
      },
    ],
  },
  {
    _id: "iygjfthdr6",
    firstName: "Максим",
    lastName: "Тарасов",
    avatar: mem24,
    messages: [],
  },
  {
    _id: "pgjfthdrg25",
    firstName: "Сергей",
    lastName: "Речной",
    avatar: mem20,
    messages: [
      {
        creatorId: "ef234padk",
        timestamp: "04:19",
        message: "привет. что ищещь здесь?",
      },
      {
        creatorId: "pgjfthdrg25",
        timestamp: "04:20",
        message: "знаешь...",
      },
      {
        creatorId: "pgjfthdrg25",
        timestamp: "04:20",
        message: "я здесь ищу только одного...",
      },
      {
        creatorId: "pgjfthdrg25",
        timestamp: "04:20",
        message:
          "покоя, умиротворения и вот этой гармонии от слияния с бесконечно вечным. от созерцания           великого фрактального подобия и от вот этого замечательного всеединства существа, бесконечно вечного, куда ни посмотри, хоть вглубь - бесконечно малое, хоть ввысь - бесконечное большое, понимаешь?",
      },
      {
        creatorId: "ef234padk",
        timestamp: "04:23",
        message: "не совсем, если честно",
      },
      {
        creatorId: "pgjfthdrg25",
        timestamp: "04:25",
        message:
          "Я как будто бы уже давно глубокий старец, бессмертный, ну или там уже почти бессмертный     который на этой планете от её самого зарождения, ещё когда только Солнце только-только сформировалось как звезда, и вот это газопылевое облако, вот, после взрыва, Солнца, когда оно вспыхнуло, как звезда, начало формировать вот эти коацерваты, планеты, понимаешь, я на этой Земле уже как будто почти пять миллиардов лет живу и знаю её вдоль и поперёк этот весь мир...",
      },
    ],
  },
];

export default chats;
